tests/resources/directpayment/getWallet/getWalletRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://impl.ws.payline.experian.com"><SOAP-ENV:Body><ns1:getWalletRequest><ns1:version>90</ns1:version><ns1:contractNumber>CB</ns1:contractNumber><ns1:walletId>walletIdzzzz</ns1:walletId><ns1:cardInd>2</ns1:cardInd><ns1:media>media pc</ns1:media></ns1:getWalletRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>